Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/distutils.tmx
Source language: en
Languages: pl

source: API Reference
pl: Podręcznik sprzęgów

source: :mod:`distutils.core` --- Core Distutils functionality
pl: :mod:`distutils.core` --- Bazowa użyteczność modułu Distutils

source: The :mod:`distutils.core` module is the only module that needs to be installed to use the Distutils. It provides the :func:`setup` (which is called from the setup script). Indirectly provides the :class:`distutils.dist.Distribution` and :class:`distutils.cmd.Command` class.
pl: Moduł :mod:`distutils.core` jest jedynym modułem, który należy zainstalować aby korzystać z Distutils. Zawiera zadanie :func:`setup`, które jest wywoływane w skryptach instalacyjnych. Pośrednio, dostarcza także klas :class:`distutils.dist.Distribution` i :class:`distutils.cmd.Command`.

source: The basic do-everything function that does most everything you could ever ask for from a Distutils method. See XXXXX
pl: Podstawowe robiące-wszystko zadanie, która zajmuje się wszystkim, czego tylko można oczekiwać od metody Distutils. Zob. XXXXX

source: The setup function takes a large number of arguments. These are laid out in the following table.
pl: Zadanie setup przyjmuje znaczną ilość argumentów. Ich opis można znaleźć w poniższej tabeli.

source: argument name
pl: nazwa parametru

source: value
pl: wartość

source: type
pl: typ

source: The name of the package
pl: Nazwa pakietu

source: a string
pl: ciąg znaków

source: The version number of the package
pl: Numer wersji pakietu

source: See :mod:`distutils.version`
pl: Zobacz :mod:`distutils.version`

source: A single line describing the package
pl: Pojedyncza linia opisująca pakiet

source: Longer description of the package
pl: Dłuższy opis pakietu

source: The name of the package author
pl: Imię i nazwisko autora pakietu

source: The email address of the package author
pl: Adres e-mail autora pakietu

source: The name of the current maintainer, if different from the author
pl: Imię osoby aktualnie opiekujacej się pakietem, jeśli jest inna niż jego autor.

source: The email address of the current maintainer, if different from the author
pl: Adres e-mail osoby aktualnie opiekujacej się pakietem, jeśli jest inna niż jego autor

source: A URL for the package (homepage)
pl: Adres URL pakietu (strona domowa)

source: a URL
pl: URL

source: A URL to download the package
pl: Adres URL, spod którego można ściągnąć pakiet

source: A list of Python packages that distutils will manipulate
pl: Lista pakietów języka pytonowskiego, na których distutils będzie operować

source: a list of strings
pl: lista ciągów znaków

source: A list of Python modules that distutils will manipulate
pl: Lista modułów języka pytonowskiego, na których distutils będzie operować

source: A list of standalone script files to be built and installed
pl: Lista wykonywalnych skryptów, które zostaną zbudowane i zainstalowane

source: A list of Python extensions to be built
pl: Lista rozszerzeń Pythona, które zostaną zbudowane

source: A list of instances of :class:`distutils.core.Extension`
pl: Lista przykładów uogólnienia :class:`distutils.core.Extension`

source: A list of categories for the package
pl: Lista kategorii, do których należy pakiet

source: The list of available categorizations is at http://pypi.python.org/pypi?:action=list_classifiers.
pl: Lista dostępnych kategorii znajduje się pod adresem http://pypi.python.org/pypi?:action=list_classifiers.

source: the :class:`Distribution` class to use
pl: Uogólnienie, która zostanie użyte zamiast :class:`Distribution`

source: A subclass of :class:`distutils.core.Distribution`
pl: podrzędne uogólnienie :class:`distutils.core.Distribution`

source: The name of the setup.py script - defaults to ``sys.argv[0]``
pl: Nazwa skryptu setup.py - domyslnie ``sys.argv[0]``

source: Arguments to supply to the setup script
pl: Argumenty do przekazania do skryptu instalacyjnego

source: default options for the setup script
pl: domyślne opcje dla skryptu instalacyjnego

source: The license for the package
pl: Licencja pakietu

source: Descriptive meta-data, see :pep:`314`
pl: Opisowe dane o danych, zob. :pep:`314`

source: A mapping of command names to :class:`Command` subclasses
pl: Słownik mapujący nazwy poleceń do uogólnień podrzędnych uogólnienia :class:`Command`

source: a dictionary
pl: słownik

source: A list of data files to install
pl: Lista plików z danymi do zainstalowania

source: a list
pl: lista

source: A mapping of package to directory names
pl: Słownik mapujący nazwy pakietów języka pytonowskiego na nazwy katalogów.

source: Run a setup script in a somewhat controlled environment, and return the :class:`distutils.dist.Distribution` instance that drives things. This is useful if you need to find out the distribution meta-data (passed as keyword args from *script* to :func:`setup`), or the contents of the config files or command-line.
pl: Wykonaj skrypt instalacyjny w umiarkowanie kontrolowanym środowisku i zwróć przykład uogólnienia :class:`distutils.dist.Distribution`, która napędza rzeczy. Przydatne, gdy potrzebujesz uzyskać informacje o danych dystrybucji (przekazane jako nazwane argumenty ze skryptu *script* dla zadania :func:`setup`), lub zawartość plików konfiguracyjnych, czy też linii poleceń.

source: *script_name* is a file that will be read and run with :func:`exec`. ``sys.argv[0]`` will be replaced with *script* for the duration of the call. *script_args* is a list of strings; if supplied, ``sys.argv[1:]`` will be replaced by *script_args* for the duration of the call.
pl: *script_name* jest nazwą pliku, który zostanie wykonany przy pomocy :func:`exec`. Na czas wykonania, ``sys.argv[0]`` zostanie zastąpione wartością *script*, a ``sys.argv[1:]`` przez *script_args* , jeśli ten parametr został określony.

source: *stop_after* tells :func:`setup` when to stop processing; possible values:
pl: *stop_after* informuje zadanie :func:`setup` kiedy powininno się zatrzymać; Możliwe wartości:

source: description
pl: opis

source: Stop after the :class:`Distribution` instance has been created and populated with the keyword arguments to :func:`setup`
pl: Skończ po tym jak zostanie przygotowany przykład uogólnienia :class:`Distribution` i wypełniona nazwanymi parametrami z wywołania zadania :func:`setup`.

source: Stop after config files have been parsed (and their data stored in the :class:`Distribution` instance)
pl: Zatrzymaj po wczytaniu plików konfiguracji (i po zachowaniu danych w przykładzie uogólnienia :class:`Distribution`)

source: Stop after the command-line (``sys.argv[1:]`` or *script_args*) have been parsed (and the data stored in the :class:`Distribution` instance.)
pl: Zatrzymaj po wczytaniu linii poleceń (``sys.argv[1:]`` lub *script_args*) (a dane zachowane w przykładzie uogólnienia :class:`Distribution`.)

source: Stop after all commands have been run (the same as if :func:`setup` had been called in the usual way). This is the default value.
pl: Przerwij uruchomienie po tym jak wszystkie polecenia zostaną wykonane. Daje to taki sam efekt jak zwyczajne uruchomienie zadania :func:`setup`. To jest wartość domyślna.

source: In addition, the :mod:`distutils.core` module exposed a number of classes that live elsewhere.
pl: Co więcej, moduł :mod:`distutils.core` zawiera sporo uogólnień które znajdują się także gdzie indziej.

source: :class:`Extension` from :mod:`distutils.extension`
pl: Uogólnienie :class:`Extension` z modułu :mod:`distutils.extension`

source: :class:`Command` from :mod:`distutils.cmd`
pl: uogólnienie :class:`Command` z modułu :mod:`distutils.cmd`

source: :class:`Distribution` from :mod:`distutils.dist`
pl: Uogólnienie :class:`Distribution` z modułu :mod:`distutils.dist`

source: A short description of each of these follows, but see the relevant module for the full reference.
pl: Poniżej znajduje się krótki opis każdej z nich, ale pełen podręcznik znajdziesz w dokumentacji odpowiedniego modułu.

source: The Extension class describes a single C or C++extension module in a setup script. It accepts the following keyword arguments in its constructor
pl: Uogólnienie Extension opisuje pojedynczy moduł rozszerzenia C lub C++ w skrypcie instalacyjnym. Przyjmuje następujące parametry kluczowe w swoim konstruktorze.

source: the full name of the extension, including any packages --- ie. *not* a filename or pathname, but Python dotted name
pl: pełna nazwa rozszerzenia, zawierająca dowolne pakiety --- tj. *nie* nazwa pliku czy nazwa ścieżki dostępu, ale wykropkowana nazwa pliku w języku pytonowskim

source: string
pl: ciąg znaków

source: list of source filenames, relative to the distribution root (where the setup script lives), in Unix form (slash- separated) for portability. Source files may be C, C++, SWIG (.i), platform-specific resource files, or whatever else is recognized by the :command:`build_ext` command as source for a Python extension.
pl: lista źródłowych nazw plików, względem katalogu głównego instalacji (tam gdzie znajduje się skrypt instalacyjny), w postaci Unixowej (oddzielonej "slash"-ami) dla przenośności. Pliki źródłowe mogą być C, C++, SWIG (.i), szczególne dla maszyny pliki zasobów, lub cokolwiek innego jest rozpoznane przez komendę :command:`build_ext` jako źródło rozszerzenia języka pytonowskiego.

source: list of directories to search for C/C++ header files (in Unix form for portability)
pl: lista katalogów do przeszukania pod kątem plików nagłówkowych C/C++ (w Unixowej postaci dla przenośności)

source: list of macros to define; each macro is defined using a 2-tuple ``(name, value)``, where *value* is either the string to define it to or ``None`` to define it without a particular value (equivalent of ``#define FOO`` in source or :option:`-DFOO` on Unix C compiler command line)
pl: lista makropoleceń do określenia; każde makropolecenie jest zdefiniowane używając 2-krotkę ``(nazwa, wartość)``, gdzie *wartość* jest albo ciągiem znaków do zdefiniowania go lub ``żaden`` z ang. - ``None`` do zdefiniowania go bez szczególnej wartości (równoważny ``#define FOO`` w źródle lub opcji :option:`-DFOO` w linii poleceń kompilatora dla Unixa)

source: (string, string) tuple or (name, ``None``)
pl: krotka (ciąg znaków, ciąg znaków) lub (nazwa, ``None``)

source: list of macros to undefine explicitly
pl: lista makropoleceń do wyłączenia definicji jawnie

source: list of directories to search for C/C++ libraries at link time
pl: lista katalogów do przeszukania pod kątem bibliotek C/C++ w czasie łączenia źródeł

source: list of library names (not filenames or paths) to link against
pl: lista nazw bibliotek (nie nazw plików czy nazw ścieżek) do przeprowadzenia łączenia źródeł.

source: list of directories to search for C/C++ libraries at run time (for shared extensions, this is when the extension is loaded)
pl: lista katalogów do przeszukania pod kątem bibliotek C/C++ w czasie wykonania programu (dla współdzielonych rozszerzeń, to jest moment gdy rozszerzenie jest ładowane)

source: list of extra files to link with (eg. object files not implied by 'sources', static library that must be explicitly specified, binary resource files, etc.)
pl: lista dodatkowych plików do podłączenia (np. plików przedmiotowych nie wynikających ze 'źródeł', statyczna biblioteka która musi być jawnie wyszczególniona, pliki zasobów binarnych, itp.)

source: any extra platform- and compiler-specific information to use when compiling the source files in 'sources'. For platforms and compilers where a command line makes sense, this is typically a list of command-line arguments, but for other platforms it could be anything.
pl: dowolne dodatkowe szczególne dla maszyny lub szczególne dla środowiska informacje do użycia podczas kompilacji plików źródłowych w 'źródłach'. Dla maszyn i kompilatorów gdzie ma sens wiersz poleceń, to jest zwykle lista parametrów wiersza polecenia, ale dla innych maszyn/kompilatorów to może być cokolwiek.

source: any extra platform- and compiler-specific information to use when linking object files together to create the extension (or to create a new static Python interpreter). Similar interpretation as for 'extra_compile_args'.
pl: dowolne dodatkowe szczególne dla maszyny lub kompilatora informacje do użycia podczas łączenia plików przedmiotów razem aby stworzyć rozszerzenie (lub by stworzyć nowy statyczny program interpretujący polecenia języka pytonowskiego). Podobna interpretacja jak dla 'extra_compile_args'.

source: list of symbols to be exported from a shared extension. Not used on all platforms, and not generally necessary for Python extensions, which typically export exactly one symbol: ``init`` + extension_name.
pl: lista symboli do wystawienia na zewnątrz ze współdzielonego rozszerzenia. Nie używane na wszystkich maszynach, i zwykle nie konieczne dla rozszerzeń języka pytonowskiego, który zwykle wystawia dokładnie jeden symbol: ``init`` + extension_name.

source: list of files that the extension depends on
pl: lista plików od którego rozszerzenie zależy

source: extension language (i.e. ``'c'``, ``'c++'``, ``'objc'``). Will be detected from the source extensions if not provided.
pl: język rozszerzeń (tj. ``'c'``, ``'c++'``, ``'objc'``). Zostanie wykryty ze źródeł rozszerzenia jeśli nie zostanie dostarczony jawnie.

source: A :class:`Distribution` describes how to build, install and package up a Python software package.
pl: Uogólnienie :class:`Distribution` określa jak zbudować, zainstalować i zapakować pakiet oprogramowania języka pytonowskiego.

source: See the :func:`setup` function for a list of keyword arguments accepted by the Distribution constructor. :func:`setup` creates a Distribution instance.
pl: Zobacz zadanie :func:`setup` dla listy parametrów kluczowych akceptowanych przez konstruktor dystrybucji. Zadanie :func:`setup` tworzy przykład dystrybucji.

source: A :class:`Command` class (or rather, an instance of one of its subclasses) implement a single distutils command.
pl: Uogólnienie :class:`Command` (lub raczej, przykład jednego z jej uogólnień podrzędnych) wypełnia pojedynczą komendę distutils.

source: :mod:`distutils.ccompiler` --- CCompiler base class
pl: :mod:`distutils.ccompiler` --- Uogólnienie podstawowe kompilatora C

source: This module provides the abstract base class for the :class:`CCompiler` classes. A :class:`CCompiler` instance can be used for all the compile and link steps needed to build a single project. Methods are provided to set options for the compiler --- macro definitions, include directories, link path, libraries and the like.
pl: Ten moduł dostarcza abstrakcyjne podstawowe uogólnienie dla uogólnień pochodnych :class:`CCompiler`. Przykład uogólnienia :class:`CCompiler` można użyć dla wszystkich kroków kompilacji i łączenia źródeł potrzebnych do zbudowania pojedynczego projektu. Sposoby postępowania są dostarczone aby ustawić opcje kompilatora --- makrodefinicje, katalogi łączenia źródeł, biblioteki i tym podobne.

source: This module provides the following functions.
pl: Ten moduł dostarcza następujące zadania.

source: Generate linker options for searching library directories and linking with specific libraries. *libraries* and *library_dirs* are, respectively, lists of library names (not filenames!) and search directories. Returns a list of command-line options suitable for use with some compiler (depending on the two format strings passed in).
pl: Generuj opcje łączenia źródeł dla przeszukiwania katalogów bibliotek i łączenia ze poszczególnymi bibliotekami. *libraries* i *library_dirs* są, odpowiednio, listami nazw bibliotek* (nie nazwami plików!) i katalogami poszukiwania. Zwraca listę opcji wiersza-poleceń odpowiednią dla użycia z danym kompilatorem (w zależności od dwóch ciągów formatujących przekazanych do wewnątrz).

source: Generate C pre-processor options (:option:`-D`, :option:`-U`, :option:`-I`) as used by at least two types of compilers: the typical Unix compiler and Visual C++. *macros* is the usual thing, a list of 1- or 2-tuples, where ``(name,)`` means undefine (:option:`-U`) macro *name*, and ``(name, value)`` means define (:option:`-D`) macro *name* to *value*. *include_dirs* is just a list of directory names to be added to the header file search path (:option:`-I`). Returns a list of command-line options suitable for either Unix compilers or Visual C++.
pl: Generuj opcje pre-procesora C (:option:`-D`, :option:`-U`, :option:`-I`) jak w użyciu przez przynajmniej dwa rodzaje kompilatorów: typowy kompilator Unixa i Visual C++. *makrodefinicje* są typową rzeczą, lista 1- lub 2-krotek gdzie ``(nazwa,)`` oznacza zdjęcie definicji (:option:`-U`) makrodefinicji *nazwa*, a ``(nazwa,wartość)`` oznacza definicję (:option:`-D`) makrodefinicji *nazwa* pod *wartość*. *include_dirs* jest po prostu listą nazw katalogów do dodania do ścieżki poszukiwania plików nagłówkowych (:option:`-I`). Zwraca listę opcji wiersza poleceń odpowiednich dla zarówno kompilatora Unixa jak i Visual C++.

source: Determine the default compiler to use for the given platform.
pl: Ustala domyślny kompilator do użytku na danej maszynie i danym środowisku.

source: *osname* should be one of the standard Python OS names (i.e. the ones returned by ``os.name``) and *platform* the common value returned by ``sys.platform`` for the platform in question.
pl: *osname* powinna być jedną ze standardowych nazw systemu operacyjnego języka pytonowskiego (tj. te zwracane przez ``os.name``) i *platform* często wartość zwracana przez ``sys.platform`` dla danego środowiska na danej maszynie.

source: The default values are ``os.name`` and ``sys.platform`` in case the parameters are not given.
pl: Wartości domyślne są ``os.name`` i ``sys.platform`` w razie gdyby parametry nie były dane.

source: Factory function to generate an instance of some CCompiler subclass for the supplied platform/compiler combination. *plat* defaults to ``os.name`` (eg. ``'posix'``, ``'nt'``), and *compiler* defaults to the default compiler for that platform. Currently only ``'posix'`` and ``'nt'`` are supported, and the default compilers are "traditional Unix interface" (:class:`UnixCCompiler` class) and Visual C++ (:class:`MSVCCompiler` class). Note that it's perfectly possible to ask for a Unix compiler object under Windows, and a Microsoft compiler object under Unix---if you supply a value for *compiler*, *plat* is ignored.
pl: Zadanie fabryczne generujące przykłady pewnego podrzędnego uogólnienia względem uogólnienia CCompiler dla dostarczonej kombinacji środowiska/kompilatora. *plat* zmienia się domyślnie na ``os.name`` (np. ``'posix'``, ``'nt'``), i *kompilator* (z ang. - *compiler* ) zmienia się domyślnie na domyślny kompilator dla danego środowiska. Obecnie tylko ``'posix'`` i ``'nt'`` są wspierane a domyślnymi kompilatorami są "tradycyjny sprzęg Unixa" (uogólnienie :class:`UnixCCompiler`) i Visual C++ (uogólnienie :class:`MSVCCompiler`). Zauważ, że jest całkowicie możliwe zapytanie o przedmiot kompilowany Unixa pod Windows, i przedmiot kompilatora Microsoftu pod Unixem --- jeśli dostarczysz wartość dla *kompilatora* (z ang. *compiler*), *plat* jest ignorowana.

source: Print list of available compilers (used by the :option:`--help-compiler` options to :command:`build`, :command:`build_ext`, :command:`build_clib`).
pl: Wypisuje listę dostępnych kompilatorów (używaną przez opcję :option:`--help-compiler` dla budowania - :command:`build`, budowania rozszerzeń - :command:`build_ext` i budowania bibliotek C - :command:`build_clib`).

source: The abstract base class :class:`CCompiler` defines the interface that must be implemented by real compiler classes. The class also has some utility methods used by several compiler classes.
pl: Abstrakcyjne podstawowe uogólnienie :class:`CCompiler` określa sprzęgi które muszą być wypełnione przez rzeczywiste uogólnienia kompilatorów. Uogólnienie także ma pewne użyteczne sposoby postępowania używane przez kilka uogólnień kompilatorów.

source: The basic idea behind a compiler abstraction class is that each instance can be used for all the compile/link steps in building a single project. Thus, attributes common to all of those compile and link steps --- include directories, macros to define, libraries to link against, etc. --- are attributes of the compiler instance. To allow for variability in how individual files are treated, most of those attributes may be varied on a per-compilation or per-link basis.
pl: Podstawową sprawą stojącą za abstrakcyjnym uogólnieniem kompilatora jest to, że każdy przykład może być użyty dla wszystkich kroków kompilacji/łączenia plików w budowaniu pojedynczego projektu. Zatem właściwości wspólne dla wszystkich kroków kompilacji i łączenia --- zawarcie katalogów, makrodefinicje do zdefiniowania, biblioteki do podłączenia itp. --- są właściwościami przykładu kompilatora. Aby umożliwić różnorodność w tym, jak pojedyncze pliki są traktowane, większość z tych właściwości może być zróżnicowanych na poziomie poszczególnych kompilacji i poszczególnych złączeń plików.

source: The constructor for each subclass creates an instance of the Compiler object. Flags are *verbose* (show verbose output), *dry_run* (don't actually execute the steps) and *force* (rebuild everything, regardless of dependencies). All of these flags default to ``0`` (off). Note that you probably don't want to instantiate :class:`CCompiler` or one of its subclasses directly - use the :func:`distutils.CCompiler.new_compiler` factory function instead.
pl: Konstruktor każdego podrzędnego uogólnienia tworzy przykład przedmiotu Kompilatora. Flagami są *verbose* (pokaż słowny wynik), *dry_run* (z ang. "na sucho" - właściwie nie wykonuj kroków) i *force* (przebuduj wszystko, niezależnie do zależności). Wszystkie te flagi domyślnie są równe ``0`` (wyłączone). Zauważ, że prawdopodobnie nie potrzebujesz dawać przykładu uogólnienia :class:`CCompiler` lub jednego z jego uogólnień podrzędnych w bezpośredni sposób - zamiast tego możesz użyć fabrykującego zadania :func:`distutils.CCompiler.new_compiler`.

source: The following methods allow you to manually alter compiler options for the instance of the Compiler class.
pl: Następujące sposoby postępowania pozwalają ręcznie zmienić opcje kompilacji dla przykładu uogólnienia Kompilatora.

source: Add *dir* to the list of directories that will be searched for header files. The compiler is instructed to search directories in the order in which they are supplied by successive calls to :meth:`add_include_dir`.
pl: Dodaj *dir do listy katalogów które będą przeszukiwane pod kątem plików nagłówkowych. Kompilator ma zadanie przeszukać katalogi w kolejności w której zostaną mu dostarczone przez kolejne wywołania sposobu postępowania :meth:`add_include_dir`.

source: Set the list of directories that will be searched to *dirs* (a list of strings). Overrides any preceding calls to :meth:`add_include_dir`; subsequent calls to :meth:`add_include_dir` add to the list passed to :meth:`set_include_dirs`. This does not affect any list of standard include directories that the compiler may search by default.
pl: Ustaw listę katalogów które będą zprzeszukiwane na *dirs* (listę ciągów znaków). Obchodzi wszystkie poprzednie wywołania sposobu postępowania :meth:`add_include_dir`; następne wywołania sposobu postępowania :meth:`add_include_dir` dodają pozycje do listy przekazywanej do sposobu postępowania :meth:`set_include_dirs`. Nie ma to wpływu na żadną listę standardowych katalogów załączanych które kompilator przeszukuje domyślnie.
